Revit 2027 API
Viewport.LabelOffset Property
 The offset is a two-dimensional vector from left bottom corner of the viewport with Rotation set to None to the left end of the viewport label line. The Z coordinate is ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ LabelOffset { get; set; }
Public Property LabelOffset As XYZ
	Get
	Set
public:
property XYZ^ LabelOffset {
	XYZ^ get ();
	void set (XYZ^ value);
}
member LabelOffset : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace